{ "data": [
    {   
      "id": "1",
      "slug": "Simon-Riisnæs-Dagfinrud",
      "title": "Simon Riisnæs Dagfinrud",
      "presentor": "Simon Riisnæs Dagfinrud",
      "type": "presentatie",
      "short_description": "Simon Riisnæs Dagfinrud",
      "imagePath":"/images/flower_3.png",
      "date": "16-02-2024",
      "semester":"1",
      "description": ""
  },
    {
      "id": "2",
      "slug": "Pre-CSS-Day",
      "title": "Pre CSS Day",
      "type": "presentatie",
      "short_description": "Op de Pre-CSS Day werd ons verteld over nieuwste uitvindingen in het gebied van CSS.",
      "imagePath": "/images/flower_2.png",
      "date": "15-03-2024",
      "semester":"1",
      "description": ""
    },
    {   
      "id": "3",
      "slug": "GSAP",
      "title": "GSAP",
      "presentor": "GSAP",
      "type": "essay",
      "short_description": "Essay over GSAP.",
      "imagePath": "/images/flower_1.png",
      "date": "26-04-2024",
      "semester":"1",
      "description": ""
    },
    {   
      "id": "4",
      "slug": "Usability en User Delight",
      "title": "Usability en User Delight",
      "type": "essay",
      "short_description": "Mijn essay op twee gelezen artikelen over de progressive enhancement.",
      "imagePath": "/images/flower_7.png",
      "date": "",
      "semester":"1",
      "description": ""
    },
    {
      "id": "5",
      "slug": "Jad Joubran",
      "title": "Jad Joubran",
      "presentor": "Jad Joubran",
      "type": "presentatie",
      "short_description": "'Build your business your way' - Jan heeft verteld over hoe je eigen eenmanszaak moet starten en hoe je effectief kan leren.",
      "imagePath": "/images/flower_5.png",
      "date": "",
      "semester":"1",
      "description": "<br><a href='https://jadjoubran.io/'>Jad Joubran</a> - een onafhankelijke JavaScript- en web performance consultant en oprichter van het interactieve leerplatform voor programmeren, heeft een boeiende presentatie gegeven over twee belangrijke onderwerpen: hoe je een eigen bedrijf start en hoe je efficiënter kunt leren.<br><br><h3>Start your business your way</h3><br>Jad deelde zijn persoonlijke weg naar het starten van een eigen bedrijf en bood waardevolle inzichten voor iedereen die hetzelfde pad overweegt. Hij benadrukte dat het belangrijk is om klein te beginnen en je product stap voor stap te laten groeien. In plaats van te streven naar een perfect en compleet product bij de lancering, raadt Jad aan om te beginnen met een eenvoudig concept. Laat gebruikers je product testen en gebruik hun feedback om verbeteringen aan te brengen. Door deze iteratieve aanpak kan je product geleidelijk groeien in complexiteit en waarde.<br><br>Hij deelde ook enkele belangrijke principes voor het opstarten van een succesvolle onderneming:<br><br><ul><li>Overtref de verwachtingen: Bied meer waarde dan wat je klanten verwachten. Als je een product verkoopt voor $80, zorg dan dat het voelt als $100. Dit bouwt een sterke en betrouwbare reputatie op.<li>Mond-tot-mondreclame: Dit is krachtiger dan welke advertentie dan ook. Echte beoordelingen van tevreden klanten, zoals buren of vrienden, zijn veel waardevoller dan betaalde advertenties.</li><li>Vermijd advertenties in het begin: Richt je eerst op het leren kennen van je doelgroep voordat je geld uitgeeft aan advertenties.</li><li>Wees voorzichtig met affiliate marketing: Hoewel dit een populair advertentiemodel is, kan het het vertrouwen van je klanten ondermijnen.</li><li>Wees niet opdringerig: Zorg ervoor dat klanten zich niet onder druk gezet voelen om actie te ondernemen. Bouw in plaats daarvan vertrouwen op door consistent kwaliteit te leveren.</li></ul><br>Hij benadrukte het belang van het creëren van een kwaliteitsproduct en het opbouwen van langdurig vertrouwen bij klanten. Hij adviseert om je niet te richten op snelle winst, maar om te genieten van het proces van het creëren van iets waardevols. Een duurzame klantrelatie is de sleutel tot succes; klanten die vertrouwen in je hebben, zullen eerder bereid zijn om over te stappen naar nieuwe projecten die je lanceert.<br><br>Hij stelde een eenvoudig maar effectief stappenplan voor om een bedrijf op te bouwen:<br><br>1. Vorm een idee.  2. Maak een prototype.  3.Publiceer het product.  4.Verzamel feedback.  5. Vorm een nieuw idee en herhaal het proces.<br><br>Jad benadrukte dat het belangrijk is om te beseffen dat perfectie niet bestaat. Beperkingen helpen je om beter prioriteiten te stellen en je te concentreren op wat echt belangrijk is. Ontwikkel je eigen unieke stijl en onderscheid jezelf van de concurrentie door je eigen weg te volgen.<br><br><h3>Hoe leren we efficiënter?</h3><br>In het tweede deel van zijn presentatie sprak Jad over het leerproces en hoe je dit effectiever kunt maken. Hij beschreef leren als een cyclus die eruitziet als volgt:<br><br>1. Informatie verkrijgen.   2. Oplossingen uitproberen.  3. Fouten maken of het juiste antwoord bereiken.  4. Conclusies trekken. <br><br>Jad benadrukte dat niet alle informatie die je leert, even goed blijft hangen. De lagen kennis die je niet regelmatig toepast, worden vaak snel vergeten. Om dit te voorkomen, raadt hij het gebruik van flashcards aan, die je helpen om belangrijke informatie te onthouden. Hij moedigt aan om nieuwe concepten direct toe te passen in projecten waar je aan werkt. Bijvoorbeeld, als je een nieuw JavaScript-concept leert, probeer het dan meteen te gebruiken in een project om het beter te verankeren in je geheugen.<br>Daarnaast herinnerde Jad aan het belang van pauzes nemen en goed slapen. Dit bevordert niet alleen je leervermogen, maar voorkomt ook burnouts, waardoor je op de lange termijn effectiever kunt blijven leren en werken."
    },

  {   
    "id": "6",
    "slug": "Progressive-Enhancement",
    "title": "Progressive Enhancement",
    "type": "essay",
    "short_description": "Mijn essay op twee gelezen artikelen over de progressive enhancement.",
    "imagePath": "/images/flower_6.png",
    "date": "",
    "semester":"1",
    "description": "<br><h2>Introductie</h2></n>Ik heb twee artikelen over de Progressive enhancement gelezen en met daarop gebaseerd kennis een verslag geschreven over dit thema. De artikelen hebben allebei een gemeenschappelijk gedachte dat het bouwen voor het web prioriteit moet geven aan de toegankelijkheid van de inhoud en acceptabele gebruikerservaring op alle apparaten en browsers.<br><br><h2>Artikel 'The power of progressive enhancement'</h2> </n> In dit artikel vertelt de auteur eerst over door hem gelaunceerde app My Browser, die ontworpen is om gedetailleerde browserrapporten te genereren. Wat My Browser zo goed maakt, is de toepassing van progressieve enhancement - een strategie die prioriteit geeft aan het maken van optimale webervaring voor de gebruiker, ongeacht apparaat of browser die gebruikt wordt.<br><br> <h3> Wat is progressive enhancement?</h3> Het idee van progressive enhancement is in de 'minimaal haalbare ervaring' (minimum viable experience). Door zich te focussen op de kernfunctionaliteit die voor alle gebruikers toegankelijk is (sterke HTML, daarna CSS en als laatste Javascript) ongeacht de beperkingen van hun browser, kan je ervoor zorgen dat website functioneel en gebruiksvriendelijk blijft.<br>De developer moet dan een standaardervaring (defaultexperience) aanbieden voor de gebruikers die een beperkte of oude browsers gebruiken, waarbij website voor de gebruiker niet 'gebroken' zal uitzien, de content behouden zal zijn, en de gebruikers dus geen indruk zullen hebben dat ze alleen een beperkte ervaring krijgen of een gevoel dat er iets ontbreekt. Dat wilt zeggen, dat als bijvoorbeeld een animatie van een gradient op een website niet werkt omdat de browser van de gebruiker het niet kan ondersteunen - is het niet erg, maar het is vooral van belang dat een cruciale functie van de website, de content, zoals bijvoorbeeld een registratieform of navigatiebar altijd ondersteund worden door elk browser. <img src='https://user-images.githubusercontent.com/96443048/212162380-08342fc5-8c46-4702-90ed-71bbca78669d.png'><br><i>Ter illustratie van dit principe is wordt in artikel bovenstaande plaatje gegeven: de gebruiker krijgt geen 'onvolledige' ervaring, maar een optimaal ervaring ongeacht de beperkingen</i><br><br><h3>De oplossingen</h3>De auteur raadt aan om niet te veel proberen om de website op elk browser hetzelfde (pixelperfect) laten uitzien, dit is bijna onmogelijk en brengt te veel onnodige gewicht en complexiteit aan de code.<br><br> <h3>Conclusie</h3>De auteur wilt ten slotte er nog op duiden, dat de progressive enhancement niet per sé meer werk is, maar dat is een verandering van denkwijze over het bouwen van de website voor iedereen, het denken over anderen en niet over jezelf. Doordat er grote groepen bestaan van Apple of Chrome gebruikers die vrijwel geen beperkingen hebben in webervaring, wordt er een indruk gecreeërd dat dit voor elk internetgebruiker dezelfde is, maar dat is niet zo en er moet met iedereen rekening worden gehouden. Het is belangrijk om te zorgen voor de optimale webervaring van elk gebruiker, ook al wordt het tot de kern versimpeld, moet de gebruiker geen indruk krijgen dat er iets aan de volledigheid van zijn ervaring ontbreekt.<br><br> <h2>Artikel 'Understanding Progressive Enhancement'</h2> In dit artikel worden twee web development strategieën 'graceful degradation' en 'progressive enhancement' vergeleken. Ze gaan allebei over hoe goed website op verschillende browsers en apparaten werkt, alleen hun focus is wel verschillend.<br>Bij progressieve enhancement draait het om het bouwen van de inhoud van de website in 'laagjes' naar buiten toe, het aanbrengen van de decoratie (CSS) en interactiviteit (Javascript) boven een sterke HTML. In de artikel wordt de analogie met een Peanut M&M wordt gebruikt om deze aanpak te illustreren, waarbij de HTML (de content) de pinda vormt, CSS de chocolade en JavaScript de harde snoepshell. Elke laag heeft zijn eigen belangen en is zelf ook volledig, waarbij dus standaardervaring voor alle gebruikers gecreërd (met content kern) en de mooiere ervaringen worden erop aangebracht, voor de gebruikers met minder beperkte browsers.<br><br><h2>Slot</h2>Deze twee artikelen hebben een gemeenschappelijk gedachte over de belang van de toepassing van de strategie progressive enhancement voor de toekomst van web development. Het wordt in de artikelen aangeraden om bij het bouwen van websites prioriteit te geven aan eenvoud, toegankelijkheid en inclusiviteit, om te beginnen met sterke HTML basis en ervoor te zorgen dat elk gebruiker een minimaal haalbare ervaring van de website krijgt, ongeacht de browser of de apparaat.<br><br><h2>Bronnen</h2> <b>'The power of progressive enhancement'</b> - <a>archive.hankchizljaw.com</a> <br> <b>'Understanding Progressive Enhancement'</b> - <a>alistapart.com'</a>"
  },

  {   
    "id": "7",
    "slug": "Fenna-de-Wilde",
    "title": "Fenna de Wilde",
    "presentor": "Fenna de Wilde",
    "type": "symposium",
    "short_description": "Gastcollege over toehankelijkheid.",
    "imagePath": "/images/flower_4.png",
    "date": "",
    "semester":"1",
    "description": "<br>Fenna de Wilde is een creatieve front-end developer met een passie voor toegankelijk design en gebruikersgerichte oplossingen. Momenteel werkt ze bij Bakken&Baeck, een Noorse, tech-gedreven designstudio, en heeft eerder ervaring opgedaan bij Build in Amsterdam, een digitaal bureau dat zich richt op branding, strategie en e-commerce. Fenna, een oud-student van CMD, is inmiddels al 4,5 jaar actief als creative front-end developer. Tijdens de 'We ♥ Web'-presentatie deelde ze haar inzichten over toegankelijkheid in design en ontwikkeling, een aspect dat vaak over het hoofd wordt gezien maar essentieel is voor een inclusieve digitale ervaring.<br><br>Fenna presenteerde verschillende websites waaraan ze heeft gewerkt, waaronder een site die genomineerd was voor de titel 'Website van het Jaar'. Recentelijk heeft ze ook gewerkt aan een crypto-website genaamd Phantom, waar ze de branding van cryptocurrency wilde herdefiniëren. Ze koos ervoor om de site een vriendelijker uiterlijk te geven, omdat de vaak gebruikte donkere thema's nieuwe gebruikers kunnen afschrikken.<br><br>In haar presentatie benadrukte Fenna het belang van toegankelijkheid voor alle gebruikers. In de digitale wereld krijgen esthetiek en vloeiende animaties vaak de meeste aandacht, maar toegankelijkheid verdient onze volledige focus.<br><br> Ze gaf enkele praktische voorbeelden en tips voor het implementeren van toegankelijkheidsrichtlijnen in de code:<ul><li>Focus State voor Toetsenbordgebruikers: Niet alle gebruikers navigeren met een muis. Het is belangrijk om een :focus-visible state toe te voegen aan interactieve elementen zodat toetsenbordgebruikers duidelijk kunnen zien waar ze zich bevinden. Dit kan bijvoorbeeld gecombineerd worden met een :hover-state.</li><br><li>ARIA (Accessible Rich Internet Applications): ARIA-attributen geven extra informatie aan hulptechnologieën zoals screenreaders. Belangrijke ARIA-attributen zijn onder andere aria-label (gebruikt voor het beschrijven van elementen), aria-controls (geeft aan welk element een ander controleert), aria-expanded (om aan te geven of een sectie is ingeklapt of uitgeklapt), en aria-live (om te markeren dat de inhoud dynamisch kan veranderen).</li><br><li>Toegankelijke Carrousels: Carrousels kunnen lastig zijn voor toegankelijkheid, vooral bij gebruik van toetsenbordnavigatie. Zorg ervoor dat de carrousel elementen het attribuut role='group' hebben, en dat kleurcontrast, lettergroottes en lijnlengtes voldoen aan de richtlijnen van het Web Accessibility Initiative (WAI).</li><br><li>Kleurcontrast: Om tekst leesbaar te maken voor gebruikers met visuele beperkingen, is het belangrijk dat het kleurcontrast tussen de tekst en de achtergrond voldoet aan de richtlijnen. Volgens de Web Content Accessibility Guidelines (WCAG) moet normale tekst een contrastverhouding van minimaal 4,5:1 hebben, terwijl grotere tekst (24px of 18px vetgedrukt) een verhouding van 3:1 moet hebben.</li><br><li>Alt-teksten voor Afbeeldingen: Alt-teksten zijn essentieel voor mensen die geen afbeeldingen kunnen zien. Deze beschrijvingen moeten beknopt en nauwkeurig zijn, zonder overbodige frasen zoals 'Afbeelding van...'.</li><br><li>'Skip to Content'-knop: Voor een betere navigatie is het nuttig om een 'Skip to Content'-knop te implementeren, zodat gebruikers snel naar de hoofdinhoud van de pagina kunnen springen.</li><br><li>Autoplay Video's en Carrousels: Zorg ervoor dat autoplay video's en carrousels altijd gepauzeerd kunnen worden, zodat ze geen afleiding vormen of gebruikers overweldigen.</li><br><li>Prefers-Reduced-Motion: Houd rekening met gebruikers die gevoelig zijn voor beweging door gebruik te maken van de prefers-reduced-motion media query, zodat animaties en bewegingen op de site worden beperkt.</ul><br>Fenna benadrukte dat als een website niet voor iedereen toegankelijk is, het zijn doel mist. Toegankelijkheid gaat om bruikbaarheid en het centraal stellen van de gebruiker. Ze sloot af met het advies om toegankelijkheidsrichtlijnen altijd in acht te nemen en de implementatie ervan regelmatig te testen en te itereren, zodat iedereen een optimale ervaring kan hebben op het web."}
]}